turbq/atprog/packs/atmel/SAM4N_DFP/1.0.49/atdf/ATSAM4N8C.atdf
          </instance>
        </module>
        <module name="MATRIX" version="11049A">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0200"/>
          </instance>
        </module>
        <module name="PIO" version="11004J">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
          </instance>
          <instance name="PIOC">
            <register-group address-space="base" name="PIOC" name-in-module="PIO" offset="0x400E1200"/>
          </instance>
        </module>
        <module name="PMC" version="11116J">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0400"/>
            <signals>
              <signal pad="PA6" function="B" group="PCK" index="0"/>
              <signal pad="PB13" function="B" group="PCK" index="0"/>
              <signal pad="PC16" function="B" group="PCK" index="0"/>
              <signal pad="PA17" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="1"/>
              <signal pad="PC17" function="B" group="PCK" index="1"/>
              <signal pad="PA18" function="B" group="PCK" index="2"/>
              <signal pad="PA31" function="B" group="PCK" index="2"/>
              <signal pad="PB3" function="B" group="PCK" index="2"/>
              <signal pad="PC14" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" version="6044J">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x40020000"/>
            <signals>
              <signal pad="PA0" function="A" group="PWM" index="0"/>
              <signal pad="PA11" function="B" group="PWM" index="0"/>
              <signal pad="PA23" function="B" group="PWM" index="0"/>
              <signal pad="PB0" function="A" group="PWM" index="0"/>
              <signal pad="PC8" function="B" group="PWM" index="0"/>
              <signal pad="PC18" function="B" group="PWM" index="0"/>
              <signal pad="PC22" function="B" group="PWM" index="0"/>
              <signal pad="PA1" function="A" group="PWM" index="1"/>
              <signal pad="PA12" function="B" group="PWM" index="1"/>
              <signal pad="PA24" function="B" group="PWM" index="1"/>
              <signal pad="PB1" function="A" group="PWM" index="1"/>
              <signal pad="PC9" function="B" group="PWM" index="1"/>
              <signal pad="PC19" function="B" group="PWM" index="1"/>
              <signal pad="PA2" function="A" group="PWM" index="2"/>
              <signal pad="PA13" function="B" group="PWM" index="2"/>
              <signal pad="PA25" function="B" group="PWM" index="2"/>
              <signal pad="PB4" function="B" group="PWM" index="2"/>
              <signal pad="PC10" function="B" group="PWM" index="2"/>
              <signal pad="PC20" function="B" group="PWM" index="2"/>
              <signal pad="PA7" function="B" group="PWM" index="3"/>
              <signal pad="PA14" function="B" group="PWM" index="3"/>
              <signal pad="PB14" function="B" group="PWM" index="3"/>
              <signal pad="PC11" function="B" group="PWM" index="3"/>
              <signal pad="PC21" function="B" group="PWM" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" version="11009D">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1400"/>
          </instance>
        </module>
        <module name="RTC" version="6056N">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1460"/>
          </instance>
        </module>
        <module name="RTT" version="6081I">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1430"/>
          </instance>
        </module>
        <module name="SPI" version="6088W">
          <instance name="SPI">
            <register-group address-space="base" name="SPI" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PA12" function="A" group="MISO"/>
              <signal pad="PA13" function="A" group="MOSI"/>
              <signal pad="PA11" function="A" group="NPCS" index="0"/>
              <signal pad="PA9" function="B" group="NPCS" index="1"/>
              <signal pad="PA31" function="A" group="NPCS" index="1"/>
              <signal pad="PB14" function="A" group="NPCS" index="1"/>
              <signal pad="PC4" function="B" group="NPCS" index="1"/>
              <signal pad="PA10" function="B" group="NPCS" index="2"/>
              <signal pad="PA30" function="B" group="NPCS" index="2"/>
              <signal pad="PB2" function="B" group="NPCS" index="2"/>
              <signal pad="PC7" function="B" group="NPCS" index="2"/>
              <signal pad="PA3" function="B" group="NPCS" index="3"/>
              <signal pad="PA5" function="B" group="NPCS" index="3"/>
              <signal pad="PA22" function="B" group="NPCS" index="3"/>
              <signal pad="PA14" function="A" group="SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="SUPC" version="6452S">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1410"/>
          </instance>
        </module>
        <module name="TC" version="6082ZF">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40010000"/>
            <signals>
              <signal pad="PA4" function="B" group="TCLK" index="0"/>
              <signal pad="PA28" function="B" group="TCLK" index="1"/>
              <signal pad="PA29" function="B" group="TCLK" index="2"/>
              <signal pad="PA0" function="B" group="TIOA" index="0"/>
              <signal pad="PA15" function="B" group="TIOA" index="1"/>
              <signal pad="PA26" function="B" group="TIOA" index="2"/>
              <signal pad="PA1" function="B" group="TIOB" index="0"/>
              <signal pad="PA16" function="B" group="TIOB" index="1"/>
              <signal pad="PA27" function="B" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40014000"/>
            <signals>
              <signal pad="PC25" function="B" group="TCLK" index="3"/>
              <signal pad="PC28" function="B" group="TCLK" index="4"/>
              <signal pad="PC31" function="B" group="TCLK" index="5"/>
              <signal pad="PC23" function="B" group="TIOA" index="3"/>
              <signal pad="PC26" function="B" group="TIOA" index="4"/>
              <signal pad="PC29" function="B" group="TIOA" index="5"/>
              <signal pad="PC24" function="B" group="TIOB" index="3"/>
              <signal pad="PC27" function="B" group="TIOB" index="4"/>
              <signal pad="PC30" function="B" group="TIOB" index="5"/>
            </signals>
          </instance>
        </module>
        <module name="TWI" version="6212O">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0x40018000"/>
            <signals>
              <signal pad="PA4" function="A" group="TWCK" index="0"/>
              <signal pad="PA3" function="A" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x4001C000"/>
            <signals>
              <signal pad="PB5" function="A" group="TWCK" index="1"/>
              <signal pad="PB4" function="A" group="TWD" index="1"/>
            </signals>
          </instance>
          <instance name="TWI2">
            <register-group address-space="base" name="TWI2" name-in-module="TWI" offset="0x40040000"/>
            <signals>
              <signal pad="PB1" function="B" group="TWCK" index="2"/>
              <signal pad="PB0" function="B" group="TWD" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="UART" version="6418G">
          <instance name="UART0">
            <register-group address-space="base" name="UART0" name-in-module="UART" offset="0x400E0600"/>
            <signals>
              <signal pad="PA9" function="A" group="URXD" index="0"/>
              <signal pad="PA10" function="A" group="UTXD" index="0"/>
            </signals>
          </instance>
          <instance name="UART1">
            <register-group address-space="base" name="UART1" name-in-module="UART" offset="0x400E0800"/>
            <signals>
              <signal pad="PB2" function="A" group="URXD" index="1"/>
              <signal pad="PB3" function="A" group="UTXD" index="1"/>
            </signals>
          </instance>
