turbq/atprog/packs/atmel/SAM4N_DFP/1.0.49/atdf/ATSAM4N8C.atdf
      <value-group caption="" name="RTC_CR__CALEVSEL">
        <value caption="Week change (every Monday at time 00:00:00)" name="WEEK" value="0x0"/>
        <value caption="Month change (every 01 of each month at time 00:00:00)" name="MONTH" value="0x1"/>
        <value caption="Year change (every January 1 at time 00:00:00)" name="YEAR" value="0x2"/>
      </value-group>
      <value-group caption="" name="RTC_SR__ACKUPD">
        <value caption="Time and calendar registers cannot be updated." name="FREERUN" value="0"/>
        <value caption="Time and calendar registers can be updated." name="UPDATE" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__ALARM">
        <value caption="No alarm matching condition occurred." name="NO_ALARMEVENT" value="0"/>
        <value caption="An alarm matching condition has occurred." name="ALARMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__SEC">
        <value caption="No second event has occurred since the last clear." name="NO_SECEVENT" value="0"/>
        <value caption="At least one second event has occurred since the last clear." name="SECEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TIMEV">
        <value caption="No time event has occurred since the last clear." name="NO_TIMEVENT" value="0"/>
        <value caption="At least one time event has occurred since the last clear." name="TIMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__CALEV">
        <value caption="No calendar event has occurred since the last clear." name="NO_CALEVENT" value="0"/>
        <value caption="At least one calendar event has occurred since the last clear." name="CALEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TDERR">
        <value caption="The internal free running counters are carrying valid values since the last read of RTC_SR." name="CORRECT" value="0"/>
        <value caption="The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid." name="ERR_TIMEDATE" value="1"/>
      </value-group>
    </module>
    <module caption="Real-time Timer" name="RTT" version="6081I">
      <register-group name="RTT">
        <register caption="Mode Register" name="RTT_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Real-time Timer Prescaler Value" mask="0x0000FFFF" name="RTPRES"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00010000" name="ALMIEN"/>
          <bitfield caption="Real-time Timer Increment Interrupt Enable" mask="0x00020000" name="RTTINCIEN"/>
          <bitfield caption="Real-time Timer Restart" mask="0x00040000" name="RTTRST"/>
          <bitfield caption="Real-time Timer Disable" mask="0x00100000" name="RTTDIS"/>
          <bitfield caption="Real-Time Clock 1Hz Clock Selection" mask="0x01000000" name="RTC1HZ"/>
        </register>
        <register caption="Alarm Register" name="RTT_AR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Alarm Value" mask="0xFFFFFFFF" name="ALMV"/>
        </register>
        <register caption="Value Register" name="RTT_VR" offset="0x08" rw="R" size="4">
          <bitfield caption="Current Real-time Value" mask="0xFFFFFFFF" name="CRTV"/>
        </register>
        <register caption="Status Register" name="RTT_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Real-time Alarm Status" mask="0x00000001" name="ALMS"/>
          <bitfield caption="Real-time Timer Increment" mask="0x00000002" name="RTTINC"/>
        </register>
      </register-group>
    </module>
    <module caption="Serial Peripheral Interface" name="SPI" version="6088W">
      <register-group name="SPI">
        <register caption="Control Register" name="SPI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="SPI Enable" mask="0x00000001" name="SPIEN"/>
          <bitfield caption="SPI Disable" mask="0x00000002" name="SPIDIS"/>
          <bitfield caption="SPI Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
        </register>
        <register caption="Mode Register" name="SPI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Master/Slave Mode" mask="0x00000001" name="MSTR"/>
          <bitfield caption="Peripheral Select" mask="0x00000002" name="PS"/>
          <bitfield caption="Chip Select Decode" mask="0x00000004" name="PCSDEC"/>
          <bitfield caption="Mode Fault Detection" mask="0x00000010" name="MODFDIS"/>
          <bitfield caption="Wait Data Read Before Transfer" mask="0x00000020" name="WDRBT"/>
          <bitfield caption="Local Loopback Enable" mask="0x00000080" name="LLB"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
          <bitfield caption="Delay Between Chip Selects" mask="0xFF000000" name="DLYBCS"/>
        </register>
        <register caption="Receive Data Register" name="SPI_RDR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
        </register>
        <register caption="Transmit Data Register" name="SPI_TDR" offset="0x0C" rw="W" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
        </register>
        <register caption="Status Register" name="SPI_SR" offset="0x10" rw="R" size="4">
          <bitfield caption="Receive Data Register Full" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Status" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of RX buffer" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of TX buffer" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="RX Buffer Full" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Status (Slave Mode Only)" mask="0x00000400" name="UNDES"/>
          <bitfield caption="SPI Enable Status" mask="0x00010000" name="SPIENS"/>
        </register>
        <register caption="Interrupt Enable Register" name="SPI_IER" offset="0x14" rw="W" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Enable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Enable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Enable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising Interrupt Enable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000400" name="UNDES"/>
        </register>
        <register caption="Interrupt Disable Register" name="SPI_IDR" offset="0x18" rw="W" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Disable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Disable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Disable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising Interrupt Disable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000400" name="UNDES"/>
        </register>
        <register caption="Interrupt Mask Register" name="SPI_IMR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Mask" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Mask" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Mask" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising Interrupt Mask" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Mask" mask="0x00000400" name="UNDES"/>
        </register>
