turbq/atprog/packs/atmel/SAM4N_DFP/1.0.49/atdf/ATSAM4N8C.atdf
      <value-group caption="" name="SUPC_SMMR__SMSMPL">
        <value caption="Supply Monitor disabled" name="SMD" value="0x0"/>
        <value caption="Continuous Supply Monitor" name="CSM" value="0x1"/>
        <value caption="Supply Monitor enabled one SLCK period every 32 SLCK periods" name="_32SLCK" value="0x2"/>
        <value caption="Supply Monitor enabled one SLCK period every 256 SLCK periods" name="_256SLCK" value="0x3"/>
        <value caption="Supply Monitor enabled one SLCK period every 2,048 SLCK periods" name="_2048SLCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMRSTEN">
        <value caption="the core reset signal &#34;vddcore_nreset&#34; is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="the core reset signal, vddcore_nreset is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMIEN">
        <value caption="the SUPC interrupt signal is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="the SUPC interrupt signal is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODRSTEN">
        <value caption="the core reset signal &#34;vddcore_nreset&#34; is not affected when a brownout detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="the core reset signal, vddcore_nreset is asserted when a brownout detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODDIS">
        <value caption="the core brownout detector is enabled." name="ENABLE" value="0"/>
        <value caption="the core brownout detector is disabled." name="DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__ONREG">
        <value caption="Internal voltage regulator is not used (external power supply is used)" name="ONREG_UNUSED" value="0"/>
        <value caption="internal voltage regulator is used" name="ONREG_USED" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__OSCBYPASS">
        <value caption="no effect. Clock selection depends on XTALSEL value." name="NO_EFFECT" value="0"/>
        <value caption="the 32-KHz XTAL oscillator is selected and is put in bypass mode." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__SMEN">
        <value caption="the supply monitor detection has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="the supply monitor detection forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__RTTEN">
        <value caption="the RTT alarm signal has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="the RTT alarm signal forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__RTCEN">
        <value caption="the RTC alarm signal has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="the RTC alarm signal forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCEN0">
        <value caption="the WKUP0 input pin is not connected with low power debouncer." name="NOT_ENABLE" value="0"/>
        <value caption="the WKUP0 input pin is connected with low power debouncer and can force a core wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCEN1">
        <value caption="the WKUP1input pin is not connected with low power debouncer." name="NOT_ENABLE" value="0"/>
        <value caption="the WKUP1 input pin is connected with low power debouncer and can force a core wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCCLR">
        <value caption="a low power debounce event does not create an immediate clear on first half GPBR registers." name="NOT_ENABLE" value="0"/>
        <value caption="a low power debounce event on WKUP0 or WKUP1 generates an immediate clear on first half GPBR registers." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__WKUPDBC">
        <value caption="Immediate, no debouncing, detected active at least on one Slow Clock edge." name="IMMEDIATE" value="0x0"/>
        <value caption="WKUPx shall be in its active state for at least 3 SLCK periods" name="_3_SCLK" value="0x1"/>
        <value caption="WKUPx shall be in its active state for at least 32 SLCK periods" name="_32_SCLK" value="0x2"/>
        <value caption="WKUPx shall be in its active state for at least 512 SLCK periods" name="_512_SCLK" value="0x3"/>
        <value caption="WKUPx shall be in its active state for at least 4,096 SLCK periods" name="_4096_SCLK" value="0x4"/>
        <value caption="WKUPx shall be in its active state for at least 32,768 SLCK periods" name="_32768_SCLK" value="0x5"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBC">
        <value caption="Disable the low power debouncer." name="DISABLE" value="0x0"/>
        <value caption="WKUP0/1 in its active state for at least 2 RTCOUT0 periods" name="_2_RTCOUT0" value="0x1"/>
        <value caption="WKUP0/1 in its active state for at least 3 RTCOUT0 periods" name="_3_RTCOUT0" value="0x2"/>
        <value caption="WKUP0/1 in its active state for at least 4 RTCOUT0 periods" name="_4_RTCOUT0" value="0x3"/>
        <value caption="WKUP0/1 in its active state for at least 5 RTCOUT0 periods" name="_5_RTCOUT0" value="0x4"/>
        <value caption="WKUP0/1 in its active state for at least 6 RTCOUT0 periods" name="_6_RTCOUT0" value="0x5"/>
        <value caption="WKUP0/1 in its active state for at least 7 RTCOUT0 periods" name="_7_RTCOUT0" value="0x6"/>
        <value caption="WKUP0/1 in its active state for at least 8 RTCOUT0 periods" name="_8_RTCOUT0" value="0x7"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN0">
        <value caption="the corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
